// 正則匹配，Email，mobile等

export default {
  email : /^[a-zA-Z0-9_.-]+@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*\.[a-zA-Z0-9]{2,6}$/,
  mobile : /^(13[0-9]|14[579]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9]|19[89])\d{8}$/,
  businessMobile : /^[0-9][0-9-]+[0-9]$/, // 支持输入数字及-，第一位及最后一位不能为-
  smsCode: /^\d{6}$/,
  username : /^[\u4E00-\u9FA5a-zA-Z0-9_-]{0,30}$/,
  password : /^[a-zA-Z0-9\~\!\@\#\$\%\^\&\*\_\+\{\}\:\"\|\<\>\?\-\=\;\'\\\,\.\/]{6,18}$/,//登入密码正则
  cardNum : /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/, //身份证号校验
  passportNum: /^[0-9a-zA-Z]+$/,//只允许数字和字母
  nickname:/^.{1,10}$/,//限制昵称长度
  telephone:/^[0-9]+$/,//只允许数字
}